---
kind: method
id: M:Autodesk.Revit.DB.View.GetTemplateParameterIds
zh: 视图
source: html/64761c8c-ed01-65b6-2b05-ebd7b02acd77.htm
---
# Autodesk.Revit.DB.View.GetTemplateParameterIds Method

**中文**: 视图

Returns a list of parameter ids that may be controlled when this view is assigned as a template.

## Syntax (C#)
```csharp
public IList<ElementId> GetTemplateParameterIds()
```

## Returns
The parameter ids that may be controlled.